[
  {
    "id": 1,
    "title": "AWS를 이용하는 방법",
    "content": "2024년 9월 12일에 4시간에 걸쳐 진행된 AWS 교육에 참여하여 AWS(Amazon Web Service)에 관한 기술들을 습득하였다. AWS VPC, AWS Lamda, AWS S3, AWS EC2 등의 AWS가 제공하는 핵심적이고 현대 소프트웨어 개발의 핵심이 되는 서비스들에 대해 알아보고 또 실습을 진행하였다. 학생으로서는 알기 힘든 AWS의 요금제, VPC 구성 방법 등을 천천히 실습해 보며 학습하여 서버 개발자로서 역량을 발전시키는 시간을 가졌고 4시간 중 1시간은 PartyRock을 활용한 애플리케이션 만들기 활동을 하며 AI와 AWS가 제공하는 잘 알려지지 않은 서비스에 대해 추가적으로 습득했다. 추가적으로 임시로 사용가능한 계정을 발급받아 교육 후 각자 원하는 실습을 하며 여러 가지 시도도 해볼 수 있었으며 AWS에 관해 거의 모든 부분을 학습하고 실습하였다.",
    "imageUri": "/mocks/aws.png",
    "categoryName": "전공영역-전공특강(방과후)참가",
    "status": "REJECT"
  },
  {
    "id": 2,
    "title": "한전 KDN 소프트웨어 경진대회",
    "content": "2024년 11월 27일 나주 한전 KDN 본사에 방문하여 그곳에서 부스를 설치하고 운영하며 소프트웨어 작품을 발표하였다.치매 예방 및 완화를 목적으로 한 Bstorm 이라는 소프트웨어를 개발하여 출전하였으며 나는 서버 개발을 맡았다.서버를 개발하며 개발을 공부하기 시작한 이래로 가장 거대한 서버 시스템을 개발하게 되었는데 40여개에 달하는 API를 개발하고 CI 파이프라인을 구성하며 여러 공부를 해보고 특히나 모놀리식 아키택쳐를 가진 서버에 대하여 많은 것을 배울 수 있었다.팀원과 협업하며 개발할 때 Git Flow와 같은 협업 이론의 정립 역시 중요하다는 생각이 들었고 무언가 안건이 없더라도 주기적으로 개발 진척도나 개발 방향을 다시 재고하는 회의의 중요성을 깨달았다.대회 당일 아침까지도 바쁘게 버그를 수정하였고 결국 서버 개발은 발표 수십 분 전에 바쁘게 완료하였지만 클라이언트에 있는 심각한 결함을 해결하지 못하여 아쉽지만 장려상을 수상하였다.",
    "imageUri": "/mocks/KDN.png",
    "categoryName": "전공영역-공문을 통한 전공분야 대회",
    "status": "APPROVE"
  },
  {
    "id": 3,
    "title": "모두의 HTML5 & CSS3",
    "author": "김인권",
    "page": 324,
    "content": "모두의 HTML5 & CSS3는 웹 개발의 기초인 HTML과 CSS를 쉽고 재미있게 배울 수 있도록 돕는 책이다. 초보자도 웹 페이지를 만들 수 있도록 기초부터 차근차근 설명하여, HTML과 CSS의 구성 요소와 스타일링 기법을 다룬다. 각 장마다 다양한 예제와 실습 기회가 제공되어 독자가 직접 따라하며 배울 수 있다. 직관적인 예제와 단계적인 설명을 통해 처음 웹 개발을 접하는 사람도 쉽게 이해할수 있다. 이 책은 HTML5의 태그들과 CSS3의 기초적인 스타일링 기법들을 실제 예제에 적용하여 독자가 실습을 통해 이해할 수 있도록 구성되어 있다. 또한 반응형 웹 디자인 방법도 다루고 있어 다양한 디바이스에 맞게 웹 페이지를 디자인하는 기술을 익힐 수 있다. 시각적으로 이해하기 쉬운 그림과 연습 문제를 통해 학슴 내용을 복습하고 부족한 부분을 보완할 수 있다. 따라서 모두의 HTML5 & CSS3는 웹 개발에 관심 있는 초보자들이 부담 없이 시작할 수 있는 좋은 입문서로, HTML과 CSS의 기초를 다지는 데 큰 도움을 준다.",
    "status": "APPROVE"
  },
  {
    "id": 4,
    "fileUri": "/mocks/toefl.png",
    "evidenceType": "TOEFL",
    "categoryName": "외국어영역-TOEFL 점수",
    "status": "PENDING"
  },
  {
    "id": 5,
    "title": "제 27회 앰잼 참여",
    "content": "Alpaco에서 주최한 제27회 앰잼에서 참여하여 생활정보 분야에서 최우수상(1위)을 달성하였다. 전국에서 모인 고등학생들과 팀일 이뤄 명대사라는 주제도 18시간 안에 앱을 개발하는 대회였다. 백엔드 개발자로서 다른 학교, 다른 나이대의 고등학생분들과 협업하여 '가치 하다'라는 이름의 앱을 개발하였으며 Springboot, Kotlin 등을 활용하여 백엔드를 담당했다. 앱 개발인 만큼 평소의 웹 개발과 다른 점이 여럿 있을 줄 알았으나 REST API 통신을 전제로 한 백엔드를 개발해서 별 다른 여려움은 없이 개발했다. 처음으로 수행한 본격적인 협업인 만큼 오히려 개발보다 Git을 이용한 협업에서 어려움을 겪었지만 결론적으로 해결하고 개발을 제 시간 내에 완료하면서 많은 것들을 배울 수 있었다.",
    "categoryName": "전공영역-전공 분야 대회 개별 참여",
    "fileUri": "/mocks/appjam.png",
    "status": "PENDING"
  },
  {
    "id": 6,
    "title": "C언어 코딩콘테스트 참여",
    "content": "2024년 5월 경부터 시작하여 6월 말까지 C언어로 소프트웨어를 개발하는 교내 코딩콘테스트에 참여하였다. 4반의 경우 2명씩 팀을 이뤄 진행하였고 DB서버를 구축하여 중간 웹 서버 없이 구현된 실시간 온라인게임을 개발하기로 하였고 결론적으로 “project return(회귀)”를 개발하였다. MariaDB와 curl라이브러리를 활용하여 로그인, 회원가입을 구현하고 게임 내에서 모든 행동을 DB에 저장하여 다른 클라이언트에서도 진행상황을 복원할 수 있도록 개발하였다. 개발하며 여러 난관이 있었는데 지나치게 활성 연결이 많아지며 DB서버가 중지되는 문제가 가장 치명적이었다. 이 문제를 해결하기 위해 DB에 연결하는 포인터의 리스트를 정리하는 기능을 만들어 능동적으로 포인터를 관리하도록 해서 해결했다. 또한 비밀번호 찾기를 위해 이메일을 전송하는 기능을 탑재했는데 이 과정에서 HTML메시지를 문자열로 만들어 전송하려고 했지만 인식하지 못하는 문제가 있었다. 이 문제는 <style>과 같은 태그를 제거하고 curl 프로토콜에서 요구하는 규격을 지켜 코드를 대대적으로 수정하여 해결하였다. 5월부터 6월까지 1달간 실시간저장, 계정관리, 전투 등 수많은 기능을 구현하며 최후에 남은 실제로 동작하는 코드 수는 60,739줄이고 결국 오류나 시간부족으로 구현에 실패한 더미코드들이 35,576줄에 달하여 이 활동에서 가장 아쉬웠던 부분이었다. 1 달이라는 시간 동안 총 누적된 코드가 75만여 줄이었던 것만큼 수많은 고뇌를 반복하고 코드를 쓰고 지우기를 수십 번 한 결과로 최우수상을 수상하는 쾌거를 달성하였다.",
    "categoryName": "전공영역-교내 해커톤 대회",
    "status": "PENDING"
  },
  {
    "id": 7,
    "title": "토끼코스 ",
    "categoryName": "인성영역-독서마라톤 토끼코스이상",
    "fileUri": "/mocks/ReadingMarathon.jpg",
    "status": "APPROVE"
  },
  {
    "id": 8,
    "title": "전기캐드기능사",
    "categoryName": "인성영역-자기주도적 활동",
    "content": "2025년 1월 방학 기간부터 전기캐드기능사 자격증 취득을 목표로 공부를 시작하였습니다. 3월 개학 이후에는 방과후 수업과 정규 수업을 통해 필기시험을 준비하였고, 그 결과 필기시험에 합격하였습니다. 이후 실기시험을 대비하기 위해 학교 실습실을 적극 활용하며 꾸준히 준비하였고, 5월 초에 전기캐드기능사 자격증을 최종 취득하였습니다.",
    "status": "REJECT"
  },
  {
    "id": 9,
    "fileUri": "/mocks/toeic.png",
    "evidenceType": "TOEIC",
    "categoryName": "외국어영역-TOEIC 점수",
    "status": "APPROVE"
  }
]
